import socket
import time

HOST = '141.223.140.80' #고다 워크스테이션
PORT = 12346 # Port 번호

try:
    s = socket.socket(socket.AF_INET, socket.SOCK_STREAM)
    s.connect((HOST,PORT))
    print('ROS server Connected to Main Server')

    while True : 
        print('순회 중')
        ############################################################################
        ########################### 순회를 하고 있다. ##################################
        ############################################################################

        # '포슨트'라는 단어가 들려오면 멈춘다
        dest = s.recv(1024).decode()
        print(dest)
        time.sleep(5)
        print('도착했습니다')
        s.sendall('도착했습니다.'.encode())
        break

     
        #     print('포슨트 들려서 멈추는 중')
        #     ##############################################################################
        #     ############################# 멈춰. ###########################################
        #     ##############################################################################
        #     print('멈췄다.')
        #     s.send('멈췄다'.encode())
        #     dest = s.recv(1024).decode()
        #     if dest == 'A구역' or dest == 'B구역' :
        #         print('A구역으로 길 안내 중')
        #         ################################################################################
        #         ############################# 목적지로 안내해 #####################################
        #         ################################################################################
        #         # 길 안내 끝남.
        #         print('도착했습니다.')
        #         s.send('도착했습니다.'.encode())
        # if stop == '포슨트 들렸다. 멈춰라' :
        #     print('포슨트 들려서 멈추는 중')
        #     ##############################################################################
        #     ############################# 멈춰. ###########################################
        #     ##############################################################################
        #     print('멈췄다.')
        #     s.send('멈췄다'.encode())
        #     dest = s.recv(1024).decode()
        #     if dest == 'A구역' or dest == 'B구역' :
        #         print('A구역으로 길 안내 중')
        #         ################################################################################
        #         ############################# 목적지로 안내해 #####################################
        #         ################################################################################
        #         # 길 안내 끝남.
        #         print('도착했습니다.')
        #         s.send('도착했습니다.'.encode())
            
            
            # complete = s.recv(1024).decode()
            # if complete == '다시 순회해라.' :
            #     print('상황 끝. 다시 시작해라')
            #     continue


except Exception as e :
    print('Failed. Error message : ', e)

finally : 
    print('Close')
    s.close()

